Show / Hide Table of Contents
Class ResultOfNLAPoint
Result of internal forces in the one position
Inheritance
System.Object
ResultOfNLAPoint
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Result
Assembly: IdeaRS.OpenModel.dll
Syntax
[Obfuscation(Feature = "renaming")]
[Obsolete]
public class ResultOfNLAPoint
Constructors
Improve this Doc   View Source
ResultOfNLAPoint()
Constructor
Declaration
public ResultOfNLAPoint()
Properties
Improve this Doc   View Source
Id
Id of point
Declaration
public int Id { get; set; }
Property Value
 Type |  Description
 System.Int32
Improve this Doc   View Source
ResultOfIncrements
Results in load case
Declaration
public List<ResultOfIncrement> ResultOfIncrements { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<ResultOfIncrement>
Improve this Doc   View Source
X
X coordinates on cross-section
Declaration
public double X { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Y
Y coordinates on cross-section
Declaration
public double Y { get; set; }
Property Value
 Type |  Description
 System.Double
 Improve this Doc
 View Source